[{"date":"January 4, 2023","title":"Deadline Closing for Names to Fly on NASA's Next Mars Rover","preview":"You have until Sept. 30 to send your names to Mars aboard the Mars 2020 rover. "},{"date":"January 3, 2023","title":"NASA's Push to Save the Mars InSight Lander's Heat Probe","preview":"The scoop on the end of the spacecraft's robotic arm will be used to 'pin' the mole against the wall of its hole."},{"date":"December 29, 2022","title":"NASA Engineers Checking InSight's Weather Sensors","preview":"An electronics issue is suspected to be preventing the sensors from sharing their data about Mars weather with the spacecraft."},{"date":"December 22, 2022","title":"Alabama High School Student Names NASA's Mars Helicopter","preview":"Vaneeza Rupani's essay was chosen as the name for the small spacecraft, which will mark NASA's first attempt at powered flight on another planet."},{"date":"December 22, 2022","title":"NASA's Mars Rover Drivers Need Your Help","preview":"Using an online tool to label Martian terrain types, you can train an artificial intelligence algorithm that could improve the way engineers guide the Curiosity rover."},{"date":"December 21, 2022","title":"NASA's Curiosity Takes Selfie With 'Mary Anning' on the Red Planet","preview":"The Mars rover has drilled three samples of rock in this clay-enriched region since arriving in July."},{"date":"December 20, 2022","title":"NASA's Perseverance Rover Will Look at Mars Through These 'Eyes'","preview":"A pair of zoomable cameras will help scientists and rover drivers with high-resolution color images."},{"date":"December 16, 2022","title":"InSight's 'Mole' Team Peers into the Pit","preview":"Efforts to save the heat probe continue."},{"date":"December 16, 2022","title":"Space History Is Made in This NASA Robot Factory","preview":"From rockets to rovers, JPL's Spacecraft Assembly Facility has been at the center of robotic spaceflight. Here's a closer look at what makes it so special."},{"date":"December 13, 2022","title":"A New Video Captures the Science of NASA's Perseverance Mars Rover","preview":"With a targeted launch date of July 30, the next robotic scientist NASA is sending to the to the Red Planet has big ambitions."},{"date":"December 12, 2022","title":"NASA's Perseverance Rover Is Midway to Mars ","preview":"Sometimes half measures can be a good thing – especially on a journey this long. The agency's latest rover only has about 146 million miles left to reach its destination."},{"date":"December 12, 2022","title":"NASA's Ingenuity Mars Helicopter Recharges Its Batteries in Flight","preview":"Headed to the Red Planet with the Perseverance rover, the pioneering helicopter is powered up for the first time in interplanetary space as part of a systems check."},{"date":"December 7, 2022","title":"How NASA's Mars Helicopter Will Reach the Red Planet's Surface","preview":"The small craft will seek to prove that powered, controlled flight is possible on another planet. But just getting it onto the surface of Mars will take a whole lot of ingenuity."},{"date":"December 6, 2022","title":"NASA Prepares for Moon and Mars With New Addition to Its Deep Space Network","preview":"Robotic spacecraft will be able to communicate with the dish using radio waves and lasers."},{"date":"December 3, 2022","title":"NASA-JPL Names 'Rolling Stones Rock' on Mars","preview":"NASA's Mars InSight mission honored one of the biggest bands of all time at Pasadena concert."}]